app/views/messages/_message.html.erb

    </div>
    <time datetime="<%= message.created_at %>" title="<%= message.created_at.strftime("%d %b  %Y at %I:%M%p") %>">
---
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test"], ["conversation_id", 1], ["user_id", 2], ["created_at", "2015-12-07 15:44:58.001372"], ["updated_at", "2015-12-07 15:44:58.001372"]]