app/views/users/index.html.erb

                          <h4 class="media-heading"><strong><%= conversation_interlocutor(conversation).name %></strong></h4>
                          <p><%= conversation.messages.last.nil? ? "No messages" : truncate(conversation.messages.last.body, length: 45) %></p>
---
SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  ORDER BY "messages"."id" DESC LIMIT 1  [["conversation_id", 1]]