app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (NOT (id = 1))  ORDER BY created_at DESC
SELECT "conversations".* FROM "conversations" WHERE (conversations.sender_id =2 OR conversations.recipient_id =2)  ORDER BY created_at DESC
---
  def index
      @users = User.where.not("id = ?",current_user.id).order("created_at DESC")
      @conversations = Conversation.involving(current_user).order("created_at DESC")